src/Services/Air/templates/AirCancel.xml

<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:univ="http://www.travelport.com/schema/universal_v39_0"
  xmlns:com="http://www.travelport.com/schema/common_v39_0"
  xmlns:air="http://www.travelport.com/schema/air_v39_0"
  >
  <soapenv:Header>
    <univ:SupportedVersions
      urVersion="universal_v39_0" airVersion="air_v39_0"
      hotelVersion="hotel_v39_0" vehicleVersion="vehicle_v39_0"
      passiveVersion="passive_v39_0" railVersion="rail_v39_0"
      cruiseVersion="cruise_v39_0"
      />
  </soapenv:Header>
  <soapenv:Body>
    <univ:AirCancelReq
      AuthorizedBy="user" TargetBranch="{{TargetBranch}}"
      RetrieveProviderReservationDetails="false" Version="1G"
      >
      <com:BillingPointOfSaleInfo OriginApplication="uAPI" />
      {{#if emulatePcc}}
      <com:OverridePCC ProviderCode="1G" PseudoCityCode="{{emulatePcc}}"/>
      {{/if}}
      <air:AirReservationLocatorCode>{{pnr}}</air:AirReservationLocatorCode>
    </univ:AirCancelReq>
  </soapenv:Body>
</soapenv:Envelope>
